DaniAeschbach/MeshtasticFirmware/variants/nrf52840/diy/elecrow_lr1262/variant.h
/*
  Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
  Copyright (c) 2016 Sandeep Mistry All right reserved.
  Copyright (c) 2018, Adafruit Industries (adafruit.com)

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.
  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
  See the GNU Lesser General Public License for more details.
  You should have received a copy of the GNU Lesser General Public
  License along with this library; if not, write to the Free Software
  Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
*/

#ifndef _VARIANT_elecrow_lr1262_
#define _VARIANT_elecrow_lr1262_

/** Master clock frequency */
#define VARIANT_MCK (64000000ul)

#define USE_LFXO // Board uses 32khz crystal for LF
// define USE_LFRC    // Board uses RC for LF

/*----------------------------------------------------------------------------
 *        Headers
 *----------------------------------------------------------------------------*/

#include "WVariant.h"

#ifdef __cplusplus
extern "C" {
#endif // __cplusplus

// Number of pins defined in PinDescription array
#define PINS_COUNT (48)
#define NUM_DIGITAL_PINS (48)
#define NUM_ANALOG_INPUTS (6)
#define NUM_ANALOG_OUTPUTS (0)

// WIRE IC AND IIC PINS
#define WIRE_INTERFACES_COUNT 1

#define PIN_WIRE_SDA (32 + 4) // P1.04
#define PIN_WIRE_SCL (0 + 11) // P0.11

// Power Enable
// #define PIN_3V3_EN (0 + 7) // P0.7, Power to Sensors // disabled for now

// LEDs
#define PIN_LED1 (0 + 13) // P0.13
#define PIN_LED2 (0 + 14) // P0.14

#define LED_BUILTIN PIN_LED1

#define LED_GREEN PIN_LED1
#define LED_BLUE PIN_LED2 // Actually red

#define LED_STATE_ON 1 // State when LED is lit

// Button
#define BUTTON_PIN (0 + 23) // P0.23

// GPS
#define PIN_GPS_TX (0 + 22) // P0.22
#define PIN_GPS_RX (0 + 20) // P0.20

#define GPS_UBLOX
// define GPS_DEBUG

// UART interfaces
#define PIN_SERIAL1_RX PIN_GPS_TX
#define PIN_SERIAL1_TX PIN_GPS_RX

#define PIN_SERIAL2_RX (-1) // Complains if not defined
#define PIN_SERIAL2_TX (-1) // Complains if not defined

// Serial interfaces
#define SPI_INTERFACES_COUNT 1

#define PIN_SPI_MISO (32 + 15) // P1.15
#define PIN_SPI_MOSI (32 + 14) // P1.14
#define PIN_SPI_SCK  (32 + 13) // P1.13
#define PIN_SPI_NSS  (32 + 12) // P1.12

// SX1262 LoRa
#define LORA_RESET  (32 + 10) // P1.10 - RESET
#define LORA_DIO1   (32 + 6)  // P1.06 - IRQ
#define LORA_BUSY   (32 + 11) // P1.11 - BUSY

#define LORA_SCK    PIN_SPI_SCK
#define LORA_MISO   PIN_SPI_MISO
#define LORA_MOSI   PIN_SPI_MOSI
#define LORA_CS     PIN_SPI_NSS

// LORA MODULES
#define USE_SX1262

#define SX126X_DIO1   LORA_DIO1
#define SX126X_RESET  LORA_RESET
#define SX126X_BUSY   LORA_BUSY
#define SX126X_CS     LORA_CS
#define SX126X_SCK    LORA_SCK
#define SX126X_MOSI   LORA_MOSI
#define SX126X_MISO   LORA_MISO
#define SX126X_TXEN   RADIOLIB_NC
#define SX126X_RXEN   RADIOLIB_NC


#define SX1262_DIO3_TCXO_VOLTAGE 3.3 // Taken from elecrow example
#define SX1262_DIO2_AS_RF_SWITCH

#define NRF_USE_SERIAL_DFU

#ifdef __cplusplus
}
#endif

/*----------------------------------------------------------------------------
 *        Arduino objects - C++ only
 *----------------------------------------------------------------------------*/

#endif
